{
  "users": [
    {
      "email": "email@example.com",
      "password": "$2a$10$P008rVmX3UPx1MSK9lFDU.7XQ9/X1EJLK9cbyPuzx2zgEaIVxlvn2",
      "name": "Сергей",
      "id": 1
    },
    {
      "email": "email2@example.com",
      "password": "$2a$10$LKLn4cDdr7NCUroK00obDu0WejzSaaEhrkZyWtUXoLwT4mOxYy616",
      "name": "Андрей",
      "id": 2
    }
  ],
  "favourites": [],
  "cart": [],
  "orders": [],
  "products": [
    {
      "id": 1,
      "title": "Naruto. Наруто. Книга 1. Наруто Удзумаки",
      "description": "Наруто Удзумаки – самый проблемный ученик академии ниндзя в деревне Коноха. День за днем он выдумывает всяческие проказы и выводит из себя окружающих! Однако даже у этого хулигана есть заветная мечта. Он собирается превзойти героев прошлого, стать величайшим ниндзя и обрести всеобщее признание! Но люди сторонятся юного Удзумаки, а кто-то даже смотрит на него с отвращением… Наруто и не подозревает, что его жизнь связана с трагедией, постигшей Коноху двенадцать лет назад…",
      "poster": "https://img-gorod.ru/28/333/2833354_detail.jpg",
      "author": "Масаси Кисимото",
      "price": 926,
      "category": "manga",
      "slug": "naruto-naruto-kniga-1-naruto-udzumaki"
    },
    {
      "id": 2,
      "title": "Торадора! Тигр и Дракон. Том 9",
      "description": "Второй год в старшей школе Такасу Рюдзи начинает с попытки улучшить внешность. Однако, есть одно неприятное обстоятельство: хотя характер у него спокойный, он унаследовал жуткие глаза своего отца-бандита, и из-за этого часто происходят недоразумения между ним и его одноклассниками. Но всё меняется, когда в первый же день нового семестра он случайно сталкивается с самым опасным созданием в школе - Айсакой Тайгой, также известной как \"Карманный Тигр\". Несмотря на миниатюрный размер, Тайга может с лёгкостью наводить трепет на окружающих, и, где бы она ни появлялась, за ней тянется \"кровавая дорожка\", из-за чего она и получила своё прозвище. После неудачного знакомства с Тайгой Рюдзи изо всех сил старается её избегать. Но случайно обнаруживает, что Тайга влюблена в его лучшего друга Китамуру Юсаку, в то же время Тайга узнаёт о его интересе к её лучшей подруге Кусиэде Минори. Тайга решает позволить Рюдзи в качестве \"личного слуги\" помочь ей с Китамурой, а в обмен она поможет Рюдзи стать ближе к Минори. Благодаря тому, что Рюдзи \"помешан\" на чистоте, а квартира Тайги расположена совсем рядом, она в итоге проводит большую часть свободного времени (исключая сон) в доме Рюдзи. Позже Рюдзи открывает такую сторону Тайги, которую люди обычно не видят, их отношения крепнут, и в конце концов расходится слух о том, что они встречаются. Так начинается история Тигра и Дракона - ТораДора!..",
      "poster": "https://img-gorod.ru/27/980/2798064_detail.jpg",
      "author": "Ююко Такэмия",
      "price": 415,
      "category": "manga",
      "slug": "toradora-tigr-i-drakon-tom-9"
    },
    {
      "id": 3,
      "title": "Человек-бензопила. Книга 6. Вперед, Человек-бензопила!",
      "description": "Дэндзи превращается в Человека-Бензопилу и вступает в ожесточенную схватку с демоном-завоеванием и ее приспешниками, олицетворяющими различное оружие. Но каким бы сильным ни был Дэндзи, его противники отступать не намерены: они пойдут на все, лишь бы одержать верх над юношей. Это будет битва до последней капли крови, где малейшая ошибка может привести к смерти. Сможет ли Человек-Бензопила одолеть своих врагов? Или же рев его мотора заглохнет навсегда?.. В книгу вошел одиннадцатый том манги (главы 89–97).",
      "poster": "https://img-gorod.ru/29/448/2944827_detail.jpg",
      "author": "Тацуки Фудзимото",
      "price": 589,
      "category": "manga",
      "slug": "chelovek-benzopila-kniga-6-vpered-chelovek-benzopila"
    },
    {
      "id": 4,
      "title": "Очень приятно, бог. Том 1",
      "description": "Старшеклассница Нанами Момодзоно оказалась на улице после того, как ее лишили крова из-за долгов отца, а сам отец пропал без вести. Повстречав загадочного незнакомца, она приняла его приглашение остановиться у него и обнаружила, что его \"дом\" - это заброшенный синтоистский храм. И в обмен на проживание в этом храме Нанами теперь должна выполнять весьма необычные обязанности...",
      "poster": "https://img-gorod.ru/26/696/2669630_detail.jpg",
      "author": "Джульетта Судзуки",
      "price": 518,
      "category": "manga",
      "slug": "ochien-priiatno-bogh-tom-1"
    },
    {
      "id": 5,
      "title": "Beastars. Выдающиеся звери. Том 8",
      "description": "Новый преступник в мире животных! Легоши получает шанс выйти из реестра мясоедов: выдающийся зверь Яхья предлагает стереть имя волка в обмен на помощь в поимке особо опасного преступника. Легоши сомневается в принципах Яхьи, но соглашается ради награды. Вдвоём они проникают на закрытую вечеринку, где Яхья пытается схватить врага, но всё идёт совсем не по плану…Манга получила ряд престижных наград, включая \"Манга Тайсё\" и культурную премию имени Осаму Тэдзуки, а также легла в основу аниме-сериала.",
      "poster": "https://img-gorod.ru/29/425/2942549_detail.jpg",
      "author": "Итагаки П.",
      "price": 761,
      "category": "manga",
      "slug": "beastars-vydayushchiesya-zveri-tom-8"
    },
    {
      "id": 6,
      "title": "Токийский гуль:re 8. Книга 15-16. Манга",
      "description": "Китимура Васю, также известный как Нимура Фурута, приводит свой дьявольский план в исполнение: он превращает Кэна Канэки в Дракона и погружает Токио в хаос... Впервые в истории следователям и гулям приходится преодолеть разногласия и объединить усилия, чтобы справиться с надвигающейся катастрофой. И для этого им нужно спасти Одноглазого Короля. Вот только Фурута и его союзники не будут молча наблюдать, как рушатся их замыслы… Грядет последняя битва, и вскоре мир ждут невероятные изменения. А в лучшую или худшую сторону, кто знает...",
      "poster": "https://img-gorod.ru/28/971/2897149_detail.jpg",
      "author": "Исида С.",
      "price": 827,
      "category": "manga",
      "slug": "tokiyskiy-gul-re-8-kniga-15-16-manga"
    },
    {
      "id": 7,
      "title": "Death Note. Black Edition. Книга 2. Манга",
      "description": "У студента колледжа Лайта Ягами есть блестящие перспективы на будущее и ни малейшей идеи, чем заполнить настоящее. Парень сходит с ума от скуки. Но все меняется, когда он находит записную книжку синигами – бога смерти. Любой человек, чье имя окажется на ее странице, умрет. Лайт решает использовать Тетрадь смерти, чтобы избавить мир от зла. Куда приведут эти благие намерения?",
      "poster": "https://img-gorod.ru/26/199/2619918_detail.jpg",
      "author": "Цугуми Ооба, Такэси Обата",
      "price": 1041,
      "category": "manga",
      "slug": "death-note-black-edition-kniga-2-manga"
    },
    {
      "id": 8,
      "title": "Heikala. Рисуем в стиле аниме и манга",
      "description": "Хейкала (Heikala) — современная художница из Финляндии, которая с помощью туши и акварели создаёт удивительные иллюстрации в стиле аниме. Миллионам поклонников нравятся ее свежие и нежные работы, на которые большое влияние оказали японская и финская культуры и, конечно же, искусство Хаяо Миядзаки. В этой книге представлены как широко известные, так и не публиковавшиеся ранее картины и скетчи. Кроме того, художница размышляет о творчестве и делится секретами своего успеха, советами по технике акварельной живописи. Книга станет отличным подарком для практикующих иллюстраторов и всех любителей популярной аниме-культуры.",
      "poster": "https://img-gorod.ru/29/223/2922372_detail.jpg",
      "author": "Хейкала",
      "price": 1280,
      "category": "manga",
      "slug": "heikala-risuem-v-stile-anime-i-manga"
    },
    {
      "id": 9,
      "title": "Путь домохозяина. Том 1",
      "description": "Бессмертный Тацу — якудза, оставивший после себя множество легенд в преступном мире. Одно его имя вселяло ужас не только в конкурентов, но даже в полицейских. Однажды он неожиданно завязывает с бандитской жизнью и выбирает новый путь... Путь домохозяина! Сможет ли Тацу позабыть своё тёмное прошлое, стать хорошим семьянином и вести спокойную жизнь? Получится ли у него сменить уличные разборки на борьбу с готовкой и пылью? Так и было положено начало уютной и благородной комедии!",
      "poster": "https://img-gorod.ru/29/426/2942674_detail.jpg",
      "author": "Оно К.",
      "price": 599,
      "category": "manga",
      "slug": "put-domohozyaina-tom-1"
    },
    {
      "id": 10,
      "title": "Убийца гоблинов, том 3 (манга)",
      "description": "Стая гоблинов во главе с лордом собирается напасть на деревню. Чтобы защитить ферму, Убийца Гоблинов решил не убегать и сразиться с полчищем. Но на сей раз ему поможет армия авантюристов...",
      "poster": "https://img-gorod.ru/29/577/2957762_detail.jpg",
      "author": "Кагю К.",
      "price": 792,
      "category": "manga",
      "slug": "ubiitsa-ghoblinov-tom-3-mangha"
    },
    {
      "id": 11,
      "title": "Манга Магическая уборка. Японское искусство наведения порядка дома, на работе и в личной жизни",
      "description": "Магическая уборка. Манга",
      "poster": "https://img-gorod.ru/29/183/2918341_detail.jpg",
      "author": "Кондо М.",
      "price": 525,
      "category": "manga",
      "slug": "manga-magicheskaya-uborka-yaponskoe-iskusstvo-navedeniya-poryadka-doma-na-rabote-i-v-lichnoy-zhizni"
    },
    {
      "id": 12,
      "title": "Манга. Восхождение героя Щита. Том 1",
      "description": "Иватани Наофуми - типичный отаку, которого нагло призывают в другой мир и просят спасти мир, попутно став одним из четырех героев, \"Героем Щита\". Недолго ломаясь, он все-таки решается пойти и спасти мир. И все бы ничего, если бы парня не ограбили на третий день, да еще и в изнасиловании обвинили... Ограбленный и униженный перед обществом, Наофуми решает найти обидчиков и задать им жару. Помогать с этим ему будет девушка из расы енотолюдей, которую он выкупил у работорговца... Неужели после такой катастрофы на его жизненном пути именно она - то , в чём он так нуждается?! Потрясающая история о том , как парень выбирается из пучины отчаяния!",
      "poster": "https://img-gorod.ru/25/064/2506497_detail.jpg",
      "author": "Кю Айя, Юсаги Анэко",
      "price": 621,
      "category": "manga",
      "slug": "mangha-voskhozhdieniie-ghieroia-shchita-tom-1"
    },
    {
      "id": 13,
      "title": "Автоматическое управление. Манга",
      "description": "Эта манга о системах автоматического управления, которые окружают нас везде - в лифтах, светофорах, стиральных машинах и другой технике. Они делают нашу жизнь легче и удобнее, позволяют экономить трудозатраты на производстве. Вы узнаете про управляющие контуры, микроконтроллеры, контакты разных типов и другую электронную начинку систем управления. Манга будет полезна всем читателям, кто интересуется электроникой и тем, как управлять разными сложными устройствами.",
      "poster": "https://img-gorod.ru/27/623/2762379_detail.jpg",
      "author": "Фудзитаки Кадзухиро, Такаяма Яма",
      "price": 1049,
      "category": "manga",
      "slug": "avtomatichieskoie-upravlieniie-mangha"
    },
    {
      "id": 14,
      "title": "Занимательная биохимия. Манга",
      "description": "Эта книга в доступной форме рассказывает об увлекательном мире биохимии. Главная героиня, старшеклассница Куми, хочет подобрать для себя правильную диету. Вместе со своим другом Немото и профессором Куросака она начинает изучать науку, которая поможет ей в достижении поставленной цели. Изложение материала организовано по принципу «от простого к сложному»: вначале читатель узнаёт о базовых терминах из области биохимии, о строении клетки, процессе фотосинтеза и дыхания, а в конечном счёте получает представление о целом ряде сложных веществ: аминокислот, углеводов, жиров, белков, нуклеиновых кислот. Кроме того, в заключительной части даются общие сведения о молекулярной биологии - науке, тесно связанной с биохимией. Книга может использоваться в качестве справочника или в качестве дополнительного источника знаний для студентов, изучающих биохимию, медицину и диетологию.",
      "poster": "https://img-gorod.ru/25/208/2520868_detail.jpg",
      "author": "Масахару Такэмура",
      "price": 1049,
      "category": "manga",
      "slug": "zanimatiel-naia-biokhimiia-mangha"
    },
    {
      "id": 15,
      "title": "Электрооборудование. Занимательная манга",
      "description": "Простой, последовательный, наглядный и необременительный путь изучения электрооборудования! Юи, дочь владельцев отеля, мечтает возвести на его месте настоящий замок. Но прежде чем строить крупные планы, надо справиться с решением элементарных задач – в частности, наладить работу электрического оборудования в здании. Благодаря знакомству с электриком Нэмото героиня манги пройдёт все этапы знакомства с электрооборудованием, начиная с простейшего (розетки и выключатели) и заканчивая электроприборами и сложными системами, включая трансформаторную подстанцию, аварийное освещение и средства защиты от стихийных бедствий. Базовая информация изложена в разделах с мангой; при этом в каждой главе приводится дополнительный материал для углубления рассматриваемой темы. Те, кому достаточно получить общее представление об устройстве и работе электрооборудования, могут пропустить эти страницы и остановиться на начальном уровне. Для широкого круга читателей, интересующихся техническими дисциплинами.",
      "poster": "https://img-gorod.ru/28/465/2846596_detail.jpg",
      "author": "Х. Игараси",
      "price": 979,
      "category": "manga",
      "slug": "eliektrooborudovaniie-zanimatiel-naia-mangha"
    },
    {
      "id": 16,
      "title": "Воспоминания Эманон: Манга",
      "description": "1967 год. Америка отправила полмиллиона солдат на войну во Вьетнаме, тестовый запуск «Аполлона-1» обернулся первыми в истории космонавтики жертвами. На киноэкранах Джеймс Бонд сражался с преступной организацией СПЕКТР, «Битлз» записывала альбом Sgt. Peppers Lonely Hearts Club Band. А молодой японский студент, который обожает научную фантастику и которому в очередной раз разбили сердце, возвращается на ночном пароме домой. Здесь он встречает загадочную девушку по имени Эманон и немедленно в неё влюбляется. Они болтают ночь напролёт обо всём подряд: о поп-музыке и джазе, о фильмах и теории литературы, о путешествиях автостопом и бейсболе. Эманон делится с ним секретом, о котором не знает ни единая душа на планете, а на утро исчезает без следа.",
      "poster": "https://img-gorod.ru/28/308/2830813_detail.jpg",
      "author": "Синдзи Кадзио, Кэндзи Цурута",
      "price": 824,
      "category": "manga",
      "slug": "vospominaniia-emanon-mangha"
    },
    {
      "id": 17,
      "title": "Туалетный мальчик Ханако, том 3",
      "description": "Нэнэ Ясиро — помощница одной из семи школьных тайн, Туалетного Ханако. Чтобы больше узнать о своём «начальнике», девушка отправляется в знаменитый «Архив шестнадцати часов», где собрана информация о прошлом и будущем учеников Камомэ. Там Нэнэ и узнаёт историю Ханако...",
      "poster": "https://img-gorod.ru/29/577/2957759_detail.jpg",
      "author": "Айда Иро",
      "price": 792,
      "category": "manga",
      "slug": "tualietnyi-mal-chik-khanako-tom-3"
    },
    {
      "id": 18,
      "title": "Sword Art Online. Том 25. Unital Ring IV",
      "description": "Кирито не может оправиться от потрясения после случайного знакомства с Эолайном, ведь этот человек в маске и глазами, и голосом напоминает ему покойного друга. Однако происшествия, затронувшие оба виртуальных мира, не позволяют Кирито предаваться эмоциям. Возможно, что всё это — начало новой войны миров. Спустя двести лет в Андерворлде снова заметны признаки грядущего конфликта. Тем временем в Unital Ring приближается решающее сражение против «Общества исследования виртуала» во главе с Мутасиной. Она командует армией из сотни игроков, порабощённых ужасной магией «Удавка проклятого». Кирито и его друзьям придётся подумать, чем ответить на огромную разницу в силах.",
      "poster": "https://img-gorod.ru/29/577/2957755_detail.jpg",
      "author": "Кавахара Р.",
      "price": 944,
      "category": "manga",
      "slug": "sword-art-online-tom-25-unital-ring-iv"
    },
    {
      "id": 19,
      "title": "Re:Zero. Жизнь с нуля в альтернативном мире. Том 12",
      "description": "Гробница продолжает испытывать Субару на прочность, и вот, когда герой вступает в четвёртый круг жизни, судьба сталкивает его с ужасной Ведьмой Зависти! Однако помощь приходит, откуда её не ждали, — от Гарфиэля! Но расслабляться слишком рано! Узнав, почему Святилище называют испытательным полигоном, Субару ищет новой встречи с Ведьмой Жадности, ведь лишь она способна указать выход из этого адского круга. Впрочем, чтобы вновь увидеть Ехидну, юноше необходимо пройти второй этап Испытания... «Узри немыслимое настоящее!» Встречайте двенадцатый том, полный горьких сожалений и надежды!",
      "poster": "https://img-gorod.ru/29/577/2957751_detail.jpg",
      "author": "Таппэй Нагацуки",
      "price": 1000,
      "category": "manga",
      "slug": "re-zero-zhizn-s-nulia-v-al-tiernativnom-mirie-tom-12"
    },
    {
      "id": 20,
      "title": "Король шаманов. Том 5",
      "description": "Битва шаманов началась, и судьба всего мира будет зависеть от того, в чьих руках окажется Король духов. Здесь с каждым часом все опаснее — грядут новое время и новый порядок! Отборочные бои позади, и Ё с друзьями с нетерпением ждут дальнейших указаний патчей. Однако прямо перед основным туром на них нападает некий Хао, называющий себя будущим Королем шаманов. Ему явно нет равных по силе, но кто же он такой и как связан с Ё?..",
      "poster": "https://img-gorod.ru/29/559/2955937_detail.jpg",
      "author": "Хироюки Такэи",
      "price": 820,
      "category": "manga",
      "slug": "korol-shamanov-tom-5"
    },
    {
      "id": 21,
      "title": "Нелюдь. Том 12",
      "description": "На авиабазе города Ирума военные пытаются обезвредить Сато. В это время премьер-министр скрывается в секретном бункере, а Кэй стремится любыми способами пробраться на авиабазу. Совместными усилиями команда Нагаи получает новых союзников, но количество подельников Сато тоже растет. Смогут ли военные и команда Нагаи помешать плану Сато по полному захвату авиабазы?..",
      "poster": "https://img-gorod.ru/29/559/2955938_detail.jpg",
      "author": "Гамон Сакураи",
      "price": 652,
      "category": "manga",
      "slug": "nieliud-tom-12"
    },
    {
      "id": 22,
      "title": "Человек-бензопила. Книга 4. Во сне. Настоящая жесть: манга",
      "description": "После ожесточенной схватки с Рэдзэ в жизни Дэндзи происходит внезапный поворот: юноша попадает в центр внимания СМИ. Практически все новостные каналы трубят об ужасающем демоне-бензопиле, объявившемся в Токио. Макима высказывает предположение, что теперь лидеры остальных стран во что бы то ни стало захотят заполучить такое редкое существо, как Дэндзи. Интуиция не обманывает главу спецотдела: в Японию начинают стягиваться лучшие наемники со всего света… И у каждого из них заключен договор с опаснейшим демоном. В четвёртую книгу вошли тома 7 и 8 («Во сне» и «Настоящая жесть»), что соответствует главам с 53-й по 70-ю. Суперобложка в издании «Человек-бензопила» — двусторонняя.",
      "poster": "https://img-gorod.ru/29/121/2912150_detail.jpg",
      "author": "Фудзимото Т.",
      "price": 926,
      "category": "manga",
      "slug": "chieloviek-bienzopila-knigha-4-vo-snie-nastoiashchaia-zhiest-mangha"
    }
  ]
}